'''In every tuple, first section is for russian text, second for Kazakh and third for English'''
'''Russian index = [0], Kazakh index = [1], English index = [2], Korean index = [3]'''

select_language = ('Выберите язык', 'Тілді таңдаңыз', 'Choose language', '언어를 선택해주세요')
select_language2 = ('Выбрать язык', 'Тілді таңдау', 'Choose language', '언어 선택')
select = ('Выберите пункт', 'Элементті таңдаңыз', 'Select the option', '옵션을 선택해주세요')
menu_select = ('Главное меню', 'Басты мәзір', 'Main menu', '메인 페이지')
Consular_fee = ('Тарифы консульского сбора', 'Консулдық алымдар')
Consular_notary_fee = ('Тарифы нотариальных действий', 'Нотариаттық іс-әрекеттер')
Apostille_info = ('Апостилирование документов', 'Құжаттарға апостиль таңбасын қою')
reg = ('Приемная:    +82 2 379 9714, +82 2 394 9716 \nФакс:    +82 2 935 9766 \nEmail:  seoul@mfa.kz \nКонсульский '
       'отдел:   +82 2 379 7876 \nГорячая линия:   +82 2 391 8906\n',

       'Қабылдау бөлмесі: +82 2 379 9714, +82 2 394 9716 \nФакс:    +82 2 935 9766 \nEmail:  seoul@mfa.kz \nКонсулдық '
       'бөлім: +82 2 379 7876 \nСенім телефоны: +82 2 391 8906\n',

       'Reception: +82 2 379 9714, +82 2 394 9716 \nFax: +82 2 935 9766 \nEmail: seoul@mfa.kz \n'
       'The Consular Department: +82 2 379 7876 \n Hotline: +82 2 391 8906',

       '비서실  +82 2 379 9714, +82 2 394 9716\n'
       '팩스  +82 2 935 9766\n'
       '이메일  seoul@mfa.kz\n'
       '영사과  +82 2 379 7876\n'
       '핫라인  +82 2 391 8906')

Adress_how = ('Как добраться', 'Қалай жетуге болады', 'How to get there', '가는 길')
Adress = ('Адрес: 53 Jangmun-ro, Yongsan-gu, Seoul (04392)', 'Адрес: 53 Jangmun-ro, Yongsan-gu, Seoul (04392)',
          'Address: 53 Jangmun-ro, Yongsan-gu, Seoul (04392)',
        '주소:서울 용산구 장문로53번길(04392)')
Adress_route = ('Ссылка откроет приложение с локацией посольства.','Сілтеме қосымшаны елшіліктің геолокациясымен ашады',
                'The link opens the application with the location of the embassy',
                '링크를 선택해주시면 대사관 주소를 앱으로 볼수 있습니다')
Google_m = 'Google maps'
Kakao_m = 'Kakao maps'
Naver_m = 'Naver maps'

'''For schedule'''
Working_schedule_text = ('🔻Режим работы:\n'
                         'Прием посетителей по консульским вопросам осуществляется в понедельник, вторник, четверг и пятницу'
                         ' с 9.00 до 12.00 ч., выдача готовых документов с 15.00 до 16.00 ч.\n'
                         'Среда — неприемный день.\n'
                         'Суббота, воскресенье, а также праздничные дни Казахстана — выходные дни.',

                         '🔻Жұмыс тәртібі:\n'
                         'Келушілерді консулдық мәселелер бойынша қабылдау дүйсенбі, сейсенбі, бейсенбі және жұма күндері '
                         'сағат 9.00-ден 12.00-ге және 15.00-ден 16.00-ге дейін жүзеге асырылады.\n'
                         'Сәрсенбі күні — қабылдамайтын күн.\n'
                         'Сенбі және жексенбі күндері, сондай-ақ Қазақстан мереке күндері - демалыс күні.',

                         '🔻Hours of operation:\n'
                         'The Consular Section is open between the hours of 9:00 a.m. - 12:00 p.m. EST every day, '
                         'except Wednesday. The Consular Section is closed on Wednesday, Saturday and Sunday.',

                         '근무시간 :\n'
                         '영사과업무관련 서류접수 시간  월‧화∙목‧금  09:00~12:00, 발급시간 : 15:00~16:00. 수요일 - 휴무 '
                         '토‧일 및 카자흐스탄 공휴일 - 휴일')

'''For consular section'''
Citizenship = ('Гражданство', 'Азаматтық')
Documentation = ('Документирование', 'Құжаттама')
Departure = ('Оформление ПМЖ', 'Тұрақты тұруға кету')
Consular_registration = ('Консульский учет', 'Консулдық тіркеу')

'''For main menu'''
Press_center = ('Пресс-центр 📰', 'Баспасөз орталығы 📰', 'Press Center 📰', '미디어 센터 📰')
Consular_section = ('Консульский отдел 📝', 'Консулдық бөлім 📝', 'Consular Section 📝', '영사과 문의 📝')
Embassy_address = ('Адрес посольства 📍', 'Елшіліктің мекен-жайы 📍', 'Embassy Address 📍', '대사관 주소 📍')
Work_schedule = ('График работы 🕛', 'Жұмыс тәртібі 🕛', 'Working Schedule 🕛', '업무 일정 🕛')
Appointment = ('Запись на прием ☎', 'Жазылу ☎', 'Appointment ☎', '연락처 ☎')
Language = ('Русский язык 🇷🇺', 'Қазақ тілі 🇰🇿', 'English 🇬🇧', '한국어 🇰🇷')
Back = ('Назад', 'Қайта оралу', 'Back', '뒤로')


'''Common'''
Docum_list = ('Перечень документов', 'Құжаттар тізімі')
Term_and_fee = ('Срок оказания и Консульский сбор', 'Беру мерзімі және Консулдық алым', 'Term of service and Consular fee'
                '복무기간 및 영사비입니다.')
Important = ('Важно❗', 'Маңызды❗')
Passport = 'Паспорт'
Link_text = ('Скачать заявление', 'Мәлімдеменi жүктеу')
Link_text2 = ('Скачать анкету-заявление', 'Өтініш формасын жүктеу')
Link_document = ('Скачать документ', 'Құжатты жүктеу', 'Download the document', '문서를 다운로드합니다.')

'''FOR VISA'''
Visa_regulations = ('Виза', 'Виза', 'Information on visa regulations', '비자 규정 관련 정보')
Visa_info = ('Виза', 'Виза','Information on the issuance of visa', '비자 발급')
Visa_form = ('Скачать форму для заполнения визы', 'Виза', 'Visa application form', '비자신청서')

"""ABOUT KAZAKHSTAN"""
About_Kazakhstan = ("О Казахстане 🇰🇿", "Қазақстан туралы 🇰🇿", "About Kazakhstan 🇰🇿", "카자흐스탄에 대하여 🇰🇿")
About_Abai = ("Абай", "Абай", "Abai", "아바이")
About_AlFarabi = ("Аль-Фараби","Әл-Фараби", "Al Farabi", "알-파라비")